
/*
!Завдання 1.
!За допомогою циклу while вивести всі прості числа в проміжку від 0 до 100.
 ? Просте число - це число яке дылиться на себе і на одиницю
 ? Послідовність простих чисел починається так:
 ? 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 
 ? 101, 103, 107, 109, 113 , 127, 131, 137, 139, 149 …
 */
console.log('Завдання 1');
//* Варыант №1
var x = 2;
function checkPrime(num){
    var i = 2;
    while(i < num/2){
        if(num % i == 0){
            return false;
        }
        i++;
    }
    return true
}
while(x <= 100){
    if(checkPrime(x)){
        console.log(x)
    }
    x++;
}

//* Варыант №2
var i=2;
while (i <= 100){ //1)перебераэмо всі цифри від 2 до 100 (н-д:5). 20) 6 менше рівне 100? (так). --і так до 100
    var j = 2;  // 5)j=3.  9)j=4. 13)j=5.
    while( j <= i){ //2)умова 2 менше рівне 5?(так).  6)3 <= 5?(так). 10)4 <= 5?(так). 14)5 <= 5? (так)
        if (i % j == 0){ //3) умова 5 на 2 ділиться без залишку (=2,5)? (ні).  7) 5/3?(1,6)((ні). 11) 5/4(1,25)(ні). 15) 5/5 (1)(так)
            break; //16)умова вірна отже break, вихід з циклу
        }
        j++; //4) робимо збільшення на 1(2+1).  8) 3+1. 12)4+1.
    }
    if (j == i) { // 17)5 дорівнює 5 (так)
        console.log(i); // 18) 5-це просте число виводимо в консоль
    }
    i++; // 19) робимо збільшення на одиницю i=5+1.
}


/*
!Завдання 2.
!реалізувати функціонал підрахунку вартості кошика в Залежно від знаходяться в ній товарів.
!Товари в кошику зберігаються в масиві. завдання:
! a. Організувати такий масив для зберігання товарів в кошику;
! b. Організувати функцію countBasketPrice, яка буде рахувати вартість кошика.
*/
document.write('Завдання 2'+ '<br>')

var basket = [  //змінна basket(корзина) в якій знаходиться масив обєктів
    {
        title: "Charlotte’s Web", //назва товару
        author: "E.B. White", //автор
        price: 6.4, //ціна
        count: 2 // к-сть товарів в корзині
    },
    {
        title: "Obstacle Is The Way",
        author: "Ryan Holiday",
        price: 13.9,
        count: 1
    },
    {
        title: "The 48 Laws of Power",
        author: "Robert Greene",
        price: 8.2,
        count: 3
    }
]
function countBasketPrice(mas){ // ф-ція отримує дані на вхід з basket
    var subBasket = 0; //змінна до якої будемо додавати результат множення обєктів
    for (var item of mas){  // item - всі обєкти п/п, mas - масив з обєктами
        subBasket += (item.price * item.count); //формула вирахунку суми в корзині (ціна обєкта помножена на к-сть товарів)
                                                //спочатку береться перштй обєкт, потім цикл повторюється і до першої суми 
                                                //додоється друга, повтор і до суми двох додається третя сума
    }
    return subBasket // коли цикл завершився subBasket, результат повертає ф-ції (mas), а та передає дані в countBasketPrice(basket)
}  
document.write('Sum in basket = ' + countBasketPrice(basket) + '<br>'); //наш масив передаємо в ф-цію countBasketPrice 

/*
!Завдання 3.
!Вивести з допомогою циклу for числа від 0 до 9, не використовуючи тіло циклу. виглядати це
!має так: for (...){пусто}
*/
document.write('Завдання 3'+ '<br>');
for(var i=0; i<=9; document.write(i++ + '<br>')){}
//в цикдлі for() можна в якості третього виразу можна використовувати: console.log, document.write, alert і т.д.
//інкермент буде працювати і втакому вигляді


/*
!Завдання 4.
!Намалювати піраміду з 20 рядами за допомогою console.log
*/
console.log('Завдання 4');
//* Варыант №1
var stringStar = ''; //змінна з пустим рядком
for (var i=0; i<20; i++){ //в умові циклу  вказую: лічильник циклу починається з 0(i=0), 
                            //цикл продовжується до i<20 і кожен раз збільшується на 1
    stringStar += 'X'; //дальше в пусту строку добавляємо 'X'. Тобто з початку в мене пустий рядок додаю 'X', 
                        //при збільнені i на 1, тобто і=2(і=1+1) отже 'X'= 'X'+'X' і в консоль виводиться 'XХ' і т.д.
    console.log(stringStar);
}

//* Варыант №2
for (i=1, line='x'; i<=20; console.log(line), i++, line += 'x');
/*
в циклі for() можна робити лічильники, один або декілька. 
Створив лічильник циклу (i=1) і лічильник піраміди "x" (line='x')
Умова, рядків має бути менше рівне 20(i<=20)
Дальше виводимо в консоль "x"(console.log(line)),
після чого робимо збільшення на 1(i++) і до "x" додаємо ще один "x" line += 'x'
і цикл повторюється з початку.
Тобто в консолі виводиться "x", і=1+1(і=2), line вже буде дорівнювати "xх"
продовжую і=2, line='xх'; 2<=20; console.log('xх')(тому, що line='xх'), i=2+1, line='xx'+'x'
цикил повторюється до тих пір поки умова покаже false(i<=20 (21<=20))
*/



























